---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSwappedReferences
source: html/95a0c5b0-ec43-df86-1ca1-098a7fee747d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSwappedReferences Property

Truss top reference must be above the bottom reference.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussSwappedReferences { get; }
```